## Plan Result (dev_global)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 8 to add, 0 to change, 8 to destroy.</code></pre>

* Create
  * module.landing_zone[0].azurerm_frontdoor.main
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;hmi-apim&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;reformscan&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;hmi-apim&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;reformscan&#34;]
  * module.landing_zone[0].azurerm_key_vault_access_policy.frontdoor_kv_access[0]
  * module.landing_zone[0].azurerm_monitor_diagnostic_setting.frontdoor_diagnostics
  * module.landing_zone[0].azurerm_role_assignment.frontdoor_kv_access[0]
* Delete
  * module.landing_zone.azurerm_frontdoor.main
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;hmi-apim&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;reformscan&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;hmi-apim&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;reformscan&#34;]
  * module.landing_zone.azurerm_key_vault_access_policy.frontdoor_kv_access[0]
  * module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics
  * module.landing_zone.azurerm_role_assignment.frontdoor_kv_access[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.landing_zone.azurerm_frontdoor.main will be destroyed
  # (because module.landing_zone is not in configuration)
  - resource "azurerm_frontdoor" "main" {
      - backend_pool_health_probes           = {
          - "defaultHealthProbe"             = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/healthProbeSettings/defaultHealthProbe"
          - "healthProbeSettings-hmi-apim"   = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/healthProbeSettings/healthProbeSettings-hmi-apim"
          - "healthProbeSettings-reformscan" = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/healthProbeSettings/healthProbeSettings-reformscan"
        } -> null
      - backend_pool_load_balancing_settings = {
          - "defaultLoadBalancing"             = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/loadBalancingSettings/defaultLoadBalancing"
          - "loadBalancingSettings-hmi-apim"   = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/loadBalancingSettings/loadBalancingSettings-hmi-apim"
          - "loadBalancingSettings-reformscan" = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/loadBalancingSettings/loadBalancingSettings-reformscan"
        } -> null
      - backend_pools                        = {
          - "defaultBackend" = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/backendPools/defaultBackend"
          - "hmi-apim"       = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/backendPools/hmi-apim"
          - "reformscan"     = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/backendPools/reformscan"
        } -> null
      - cname                                = "hmcts-preview.azurefd.net" -> null
      - explicit_resource_order              = [
          - {
              - backend_pool_health_probe_ids   = [
                  - "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/healthProbeSettings/defaultHealthProbe",
                  - "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/healthProbeSettings/healthProbeSettings-hmi-apim",
                  - "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/healthProbeSettings/healthProbeSettings-reformscan",
                ]
              - backend_pool_ids                = [
                  - "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/backendPools/defaultBackend",
                  - "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/backendPools/hmi-apim",
                  - "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/backendPools/reformscan",
                ]
              - backend_pool_load_balancing_ids = [
                  - "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/loadBalancingSettings/defaultLoadBalancing",
                  - "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/loadBalancingSettings/loadBalancingSettings-hmi-apim",
                  - "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/loadBalancingSettings/loadBalancingSettings-reformscan",
                ]
              - frontend_endpoint_ids           = [
                  - "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/frontendEndpoints/hmcts-preview-azurefd-net",
                  - "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/frontendEndpoints/hmi-apim",
                  - "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/frontendEndpoints/reformscan",
                ]
              - routing_rule_ids                = [
                  - "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/routingRules/defaultRouting",
                  - "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/routingRules/hmi-apim",
                  - "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/routingRules/reformscan",
                  - "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/routingRules/hmi-apimHttpsRedirect",
                  - "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/routingRules/reformscanHttpsRedirect",
                ]
            },
        ] -> null
      - friendly_name                        = "hmcts-preview" -> null
      - frontend_endpoints                   = {
          - "hmcts-preview-azurefd-net" = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/frontendEndpoints/hmcts-preview-azurefd-net"
          - "hmi-apim"                  = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/frontendEndpoints/hmi-apim"
          - "reformscan"                = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/frontendEndpoints/reformscan"
        } -> null
      - header_frontdoor_id                  = "7a3006d2-ab3f-4b14-8feb-3116b05171f2" -> null
      - id                                   = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview" -> null
      - load_balancer_enabled                = true -> null
      - name                                 = "hmcts-preview" -> null
      - resource_group_name                  = "lz-preview-rg" -> null
      - routing_rules                        = {
          - "defaultRouting"          = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/routingRules/defaultRouting"
          - "hmi-apim"                = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/routingRules/hmi-apim"
          - "hmi-apimHttpsRedirect"   = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/routingRules/hmi-apimHttpsRedirect"
          - "reformscan"              = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/routingRules/reformscan"
          - "reformscanHttpsRedirect" = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/routingRules/reformscanHttpsRedirect"
        } -> null
      - tags                                 = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/azure-platform-terraform"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "development"
        } -> null

      - backend_pool {
          - health_probe_name   = "defaultHealthProbe" -> null
          - id                  = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/backendPools/defaultBackend" -> null
          - load_balancing_name = "defaultLoadBalancing" -> null
          - name                = "defaultBackend" -> null

          - backend {
              - address     = "www.bing.com" -> null
              - enabled     = true -> null
              - host_header = "www.bing.com" -> null
              - http_port   = 80 -> null
              - https_port  = 443 -> null
              - priority    = 1 -> null
              - weight      = 50 -> null
            }
        }
      - backend_pool {
          - health_probe_name   = "healthProbeSettings-hmi-apim" -> null
          - id                  = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/backendPools/hmi-apim" -> null
          - load_balancing_name = "loadBalancingSettings-hmi-apim" -> null
          - name                = "hmi-apim" -> null

          - backend {
              - address     = "firewall-nonprodi-palo-hmiapimdev.uksouth.cloudapp.azure.com" -> null
              - enabled     = true -> null
              - host_header = "hmi-apim.dev.platform.hmcts.net" -> null
              - http_port   = 80 -> null
              - https_port  = 443 -> null
              - priority    = 1 -> null
              - weight      = 50 -> null
            }
        }
      - backend_pool {
          - health_probe_name   = "healthProbeSettings-reformscan" -> null
          - id                  = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/backendPools/reformscan" -> null
          - load_balancing_name = "loadBalancingSettings-reformscan" -> null
          - name                = "reformscan" -> null

          - backend {
              - address     = "firewall-prod-int-palo-reformscanpreview.uksouth.cloudapp.azure.com" -> null
              - enabled     = true -> null
              - host_header = "reformscan.preview.platform.hmcts.net" -> null
              - http_port   = 80 -> null
              - https_port  = 443 -> null
              - priority    = 1 -> null
              - weight      = 50 -> null
            }
        }

      - backend_pool_health_probe {
          - enabled             = true -> null
          - id                  = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/healthProbeSettings/defaultHealthProbe" -> null
          - interval_in_seconds = 120 -> null
          - name                = "defaultHealthProbe" -> null
          - path                = "/" -> null
          - probe_method        = "GET" -> null
          - protocol            = "Http" -> null
        }
      - backend_pool_health_probe {
          - enabled             = false -> null
          - id                  = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/healthProbeSettings/healthProbeSettings-hmi-apim" -> null
          - interval_in_seconds = 120 -> null
          - name                = "healthProbeSettings-hmi-apim" -> null
          - path                = "/health/liveness" -> null
          - probe_method        = "GET" -> null
          - protocol            = "Http" -> null
        }
      - backend_pool_health_probe {
          - enabled             = false -> null
          - id                  = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/healthProbeSettings/healthProbeSettings-reformscan" -> null
          - interval_in_seconds = 120 -> null
          - name                = "healthProbeSettings-reformscan" -> null
          - path                = "/health/liveness" -> null
          - probe_method        = "GET" -> null
          - protocol            = "Http" -> null
        }

      - backend_pool_load_balancing {
          - additional_latency_milliseconds = 0 -> null
          - id                              = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/loadBalancingSettings/defaultLoadBalancing" -> null
          - name                            = "defaultLoadBalancing" -> null
          - sample_size                     = 4 -> null
          - successful_samples_required     = 2 -> null
        }
      - backend_pool_load_balancing {
          - additional_latency_milliseconds = 0 -> null
          - id                              = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/loadBalancingSettings/loadBalancingSettings-hmi-apim" -> null
          - name                            = "loadBalancingSettings-hmi-apim" -> null
          - sample_size                     = 4 -> null
          - successful_samples_required     = 2 -> null
        }
      - backend_pool_load_balancing {
          - additional_latency_milliseconds = 0 -> null
          - id                              = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/loadBalancingSettings/loadBalancingSettings-reformscan" -> null
          - name                            = "loadBalancingSettings-reformscan" -> null
          - sample_size                     = 4 -> null
          - successful_samples_required     = 2 -> null
        }

      - backend_pool_settings {
          - backend_pools_send_receive_timeout_seconds   = 60 -> null
          - enforce_backend_pools_certificate_name_check = true -> null
        }

      - frontend_endpoint {
          - host_name                    = "hmcts-preview.azurefd.net" -> null
          - id                           = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/frontendEndpoints/hmcts-preview-azurefd-net" -> null
          - name                         = "hmcts-preview-azurefd-net" -> null
          - session_affinity_enabled     = false -> null
          - session_affinity_ttl_seconds = 0 -> null
        }
      - frontend_endpoint {
          - host_name                               = "hmi-apim.dev.platform.hmcts.net" -> null
          - id                                      = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/frontendEndpoints/hmi-apim" -> null
          - name                                    = "hmi-apim" -> null
          - session_affinity_enabled                = false -> null
          - session_affinity_ttl_seconds            = 0 -> null
          - web_application_firewall_policy_link_id = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/hmiapimpreview" -> null
        }
      - frontend_endpoint {
          - host_name                               = "reformscan.preview.platform.hmcts.net" -> null
          - id                                      = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/frontendEndpoints/reformscan" -> null
          - name                                    = "reformscan" -> null
          - session_affinity_enabled                = false -> null
          - session_affinity_ttl_seconds            = 0 -> null
          - web_application_firewall_policy_link_id = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/reformscanpreview" -> null
        }

      - routing_rule {
          - accepted_protocols = [
              - "Http",
              - "Https",
            ] -> null
          - enabled            = true -> null
          - frontend_endpoints = [
              - "hmcts-preview-azurefd-net",
            ] -> null
          - id                 = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/routingRules/defaultRouting" -> null
          - name               = "defaultRouting" -> null
          - patterns_to_match  = [
              - "/*",
            ] -> null

          - forwarding_configuration {
              - backend_pool_name                     = "defaultBackend" -> null
              - cache_enabled                         = false -> null
              - cache_query_parameter_strip_directive = "StripAll" -> null
              - cache_query_parameters                = [] -> null
              - cache_use_dynamic_compression         = false -> null
              - forwarding_protocol                   = "MatchRequest" -> null
            }
        }
      - routing_rule {
          - accepted_protocols = [
              - "Https",
            ] -> null
          - enabled            = true -> null
          - frontend_endpoints = [
              - "hmi-apim",
            ] -> null
          - id                 = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/routingRules/hmi-apim" -> null
          - name               = "hmi-apim" -> null
          - patterns_to_match  = [
              - "/*",
            ] -> null

          - forwarding_configuration {
              - backend_pool_name                     = "hmi-apim" -> null
              - cache_enabled                         = false -> null
              - cache_query_parameter_strip_directive = "StripAll" -> null
              - cache_query_parameters                = [] -> null
              - cache_use_dynamic_compression         = false -> null
              - forwarding_protocol                   = "HttpOnly" -> null
            }
        }
      - routing_rule {
          - accepted_protocols = [
              - "Https",
            ] -> null
          - enabled            = true -> null
          - frontend_endpoints = [
              - "reformscan",
            ] -> null
          - id                 = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/routingRules/reformscan" -> null
          - name               = "reformscan" -> null
          - patterns_to_match  = [
              - "/*",
            ] -> null

          - forwarding_configuration {
              - backend_pool_name                     = "reformscan" -> null
              - cache_enabled                         = false -> null
              - cache_query_parameter_strip_directive = "StripAll" -> null
              - cache_query_parameters                = [] -> null
              - cache_use_dynamic_compression         = false -> null
              - forwarding_protocol                   = "HttpOnly" -> null
            }
        }
      - routing_rule {
          - accepted_protocols = [
              - "Http",
            ] -> null
          - enabled            = true -> null
          - frontend_endpoints = [
              - "hmi-apim",
            ] -> null
          - id                 = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/routingRules/hmi-apimHttpsRedirect" -> null
          - name               = "hmi-apimHttpsRedirect" -> null
          - patterns_to_match  = [
              - "/*",
            ] -> null

          - redirect_configuration {
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }
      - routing_rule {
          - accepted_protocols = [
              - "Http",
            ] -> null
          - enabled            = true -> null
          - frontend_endpoints = [
              - "reformscan",
            ] -> null
          - id                 = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/routingRules/reformscanHttpsRedirect" -> null
          - name               = "reformscanHttpsRedirect" -> null
          - patterns_to_match  = [
              - "/*",
            ] -> null

          - redirect_configuration {
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["hmi-apim"] will be destroyed
  # (because module.landing_zone is not in configuration)
  - resource "azurerm_frontdoor_custom_https_configuration" "https" {
      - custom_https_provisioning_enabled = true -> null
      - frontend_endpoint_id              = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/frontendEndpoints/hmi-apim" -> null
      - id                                = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/customHttpsConfiguration/hmi-apim" -> null

      - custom_https_configuration {
          - certificate_source    = "FrontDoor" -> null
          - minimum_tls_version   = "1.2" -> null
          - provisioning_state    = "Enabled" -> null
          - provisioning_substate = "CertificateDeployed" -> null
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["reformscan"] will be destroyed
  # (because module.landing_zone is not in configuration)
  - resource "azurerm_frontdoor_custom_https_configuration" "https" {
      - custom_https_provisioning_enabled = true -> null
      - frontend_endpoint_id              = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/frontendEndpoints/reformscan" -> null
      - id                                = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/customHttpsConfiguration/reformscan" -> null

      - custom_https_configuration {
          - certificate_source    = "FrontDoor" -> null
          - minimum_tls_version   = "1.2" -> null
          - provisioning_state    = "Enabled" -> null
          - provisioning_substate = "CertificateDeployed" -> null
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["hmi-apim"] will be destroyed
  # (because module.landing_zone is not in configuration)
  - resource "azurerm_frontdoor_firewall_policy" "custom" {
      - custom_block_response_status_code = 0 -> null
      - enabled                           = true -> null
      - frontend_endpoint_ids             = [
          - "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourcegroups/lz-preview-rg/providers/Microsoft.Network/frontdoors/hmcts-preview/frontendendpoints/hmi-apim",
        ] -> null
      - id                                = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/hmiapimpreview" -> null
      - location                          = "global" -> null
      - mode                              = "Prevention" -> null
      - name                              = "hmiapimpreview" -> null
      - resource_group_name               = "lz-preview-rg" -> null
      - tags                              = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/azure-platform-terraform"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "development"
        } -> null

      - managed_rule {
          - type    = "DefaultRuleSet" -> null
          - version = "1.0" -> null
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["reformscan"] will be destroyed
  # (because module.landing_zone is not in configuration)
  - resource "azurerm_frontdoor_firewall_policy" "custom" {
      - custom_block_response_status_code = 0 -> null
      - enabled                           = true -> null
      - frontend_endpoint_ids             = [
          - "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourcegroups/lz-preview-rg/providers/Microsoft.Network/frontdoors/hmcts-preview/frontendendpoints/reformscan",
        ] -> null
      - id                                = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/reformscanpreview" -> null
      - location                          = "global" -> null
      - mode                              = "Prevention" -> null
      - name                              = "reformscanpreview" -> null
      - resource_group_name               = "lz-preview-rg" -> null
      - tags                              = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/azure-platform-terraform"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "development"
        } -> null

      - managed_rule {
          - type    = "DefaultRuleSet" -> null
          - version = "1.0" -> null
        }
    }

  # module.landing_zone.azurerm_key_vault_access_policy.frontdoor_kv_access[0] will be destroyed
  # (because module.landing_zone is not in configuration)
  - resource "azurerm_key_vault_access_policy" "frontdoor_kv_access" {
      - certificate_permissions = [
          - "Get",
          - "List",
        ] -> null
      - id                      = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/cft-platform-dev-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsdev/objectId/0a7e9367-4349-4b24-974a-bfa7b23a38fc" -> null
      - key_permissions         = [
          - "Get",
          - "List",
        ] -> null
      - key_vault_id            = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/cft-platform-dev-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsdev" -> null
      - object_id               = "0a7e9367-4349-4b24-974a-bfa7b23a38fc" -> null
      - secret_permissions      = [
          - "Get",
          - "List",
        ] -> null
      - storage_permissions     = [] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
    }

  # module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics will be destroyed
  # (because module.landing_zone is not in configuration)
  - resource "azurerm_monitor_diagnostic_setting" "frontdoor_diagnostics" {
      - id                         = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview|fd-log-analytics" -> null
      - log_analytics_workspace_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod" -> null
      - name                       = "fd-log-analytics" -> null
      - target_resource_id         = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview" -> null

      - enabled_log {
          - category = "FrontdoorAccessLog" -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      - enabled_log {
          - category = "FrontdoorWebApplicationFirewallLog" -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }

      - log {
          - category = "FrontdoorAccessLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      - log {
          - category = "FrontdoorWebApplicationFirewallLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
    }

  # module.landing_zone.azurerm_role_assignment.frontdoor_kv_access[0] will be destroyed
  # (because module.landing_zone is not in configuration)
  - resource "azurerm_role_assignment" "frontdoor_kv_access" {
      - id                   = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/cft-platform-dev-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsdev/providers/Microsoft.Authorization/roleAssignments/a01c945a-cb59-a575-5601-a8e39187c5ae" -> null
      - name                 = "a01c945a-cb59-a575-5601-a8e39187c5ae" -> null
      - principal_id         = "0a7e9367-4349-4b24-974a-bfa7b23a38fc" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> null
      - role_definition_name = "Key Vault Secrets User" -> null
      - scope                = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/cft-platform-dev-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsdev" -> null
    }

  # module.landing_zone[0].azurerm_frontdoor.main will be created
  + resource "azurerm_frontdoor" "main" {
      + backend_pool_health_probes           = (known after apply)
      + backend_pool_load_balancing_settings = (known after apply)
      + backend_pools                        = (known after apply)
      + cname                                = (known after apply)
      + explicit_resource_order              = (known after apply)
      + friendly_name                        = "hmcts-preview"
      + frontend_endpoints                   = (known after apply)
      + header_frontdoor_id                  = (known after apply)
      + id                                   = (known after apply)
      + load_balancer_enabled                = true
      + name                                 = "hmcts-preview"
      + resource_group_name                  = "lz-preview-rg"
      + routing_rules                        = (known after apply)
      + tags                                 = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }

      + backend_pool {
          + health_probe_name   = "defaultHealthProbe"
          + id                  = (known after apply)
          + load_balancing_name = "defaultLoadBalancing"
          + name                = "defaultBackend"

          + backend {
              + address     = "www.bing.com"
              + enabled     = true
              + host_header = "www.bing.com"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-hmi-apim"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-hmi-apim"
          + name                = "hmi-apim"

          + backend {
              + address     = "firewall-nonprodi-palo-hmiapimdev.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "hmi-apim.dev.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-reformscan"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-reformscan"
          + name                = "reformscan"

          + backend {
              + address     = "firewall-prod-int-palo-reformscanpreview.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "reformscan.preview.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }

      + backend_pool_health_probe {
          + enabled             = true
          + id                  = (known after apply)
          + interval_in_seconds = 120
          + name                = "defaultHealthProbe"
          + path                = "/"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = false
          + id                  = (known after apply)
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-hmi-apim"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = false
          + id                  = (known after apply)
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-reformscan"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }

      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + id                              = (known after apply)
          + name                            = "defaultLoadBalancing"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + id                              = (known after apply)
          + name                            = "loadBalancingSettings-hmi-apim"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + id                              = (known after apply)
          + name                            = "loadBalancingSettings-reformscan"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }

      + backend_pool_settings {
          + backend_pools_send_receive_timeout_seconds   = 60
          + enforce_backend_pools_certificate_name_check = true
        }

      + frontend_endpoint {
          + host_name                    = "hmcts-preview.azurefd.net"
          + id                           = (known after apply)
          + name                         = "hmcts-preview-azurefd-net"
          + session_affinity_enabled     = false
          + session_affinity_ttl_seconds = 0
        }
      + frontend_endpoint {
          + host_name                               = "hmi-apim.dev.platform.hmcts.net"
          + id                                      = (known after apply)
          + name                                    = "hmi-apim"
          + session_affinity_enabled                = false
          + session_affinity_ttl_seconds            = 0
          + web_application_firewall_policy_link_id = (known after apply)
        }
      + frontend_endpoint {
          + host_name                               = "reformscan.preview.platform.hmcts.net"
          + id                                      = (known after apply)
          + name                                    = "reformscan"
          + session_affinity_enabled                = false
          + session_affinity_ttl_seconds            = 0
          + web_application_firewall_policy_link_id = (known after apply)
        }

      + routing_rule {
          + accepted_protocols = [
              + "Http",
              + "Https",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "hmcts-preview-azurefd-net",
            ]
          + id                 = (known after apply)
          + name               = "defaultRouting"
          + patterns_to_match  = [
              + "/*",
            ]

          + forwarding_configuration {
              + backend_pool_name                     = "defaultBackend"
              + cache_enabled                         = false
              + cache_query_parameter_strip_directive = "StripAll"
              + cache_use_dynamic_compression         = false
              + forwarding_protocol                   = "MatchRequest"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Https",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "hmi-apim",
            ]
          + id                 = (known after apply)
          + name               = "hmi-apim"
          + patterns_to_match  = [
              + "/*",
            ]

          + forwarding_configuration {
              + backend_pool_name                     = "hmi-apim"
              + cache_enabled                         = false
              + cache_query_parameter_strip_directive = "StripAll"
              + cache_use_dynamic_compression         = false
              + forwarding_protocol                   = "HttpOnly"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Https",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "reformscan",
            ]
          + id                 = (known after apply)
          + name               = "reformscan"
          + patterns_to_match  = [
              + "/*",
            ]

          + forwarding_configuration {
              + backend_pool_name                     = "reformscan"
              + cache_enabled                         = false
              + cache_query_parameter_strip_directive = "StripAll"
              + cache_use_dynamic_compression         = false
              + forwarding_protocol                   = "HttpOnly"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "hmi-apim",
            ]
          + id                 = (known after apply)
          + name               = "hmi-apimHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "reformscan",
            ]
          + id                 = (known after apply)
          + name               = "reformscanHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
    }

  # module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https["hmi-apim"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/frontendEndpoints/hmi-apim"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https["reformscan"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/frontendEndpoints/reformscan"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["hmi-apim"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "hmiapimpreview"
      + resource_group_name   = "lz-preview-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["reformscan"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "reformscanpreview"
      + resource_group_name   = "lz-preview-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.landing_zone[0].azurerm_key_vault_access_policy.frontdoor_kv_access[0] will be created
  + resource "azurerm_key_vault_access_policy" "frontdoor_kv_access" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/cft-platform-dev-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsdev"
      + object_id               = "0a7e9367-4349-4b24-974a-bfa7b23a38fc"
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.landing_zone[0].azurerm_monitor_diagnostic_setting.frontdoor_diagnostics will be created
  + resource "azurerm_monitor_diagnostic_setting" "frontdoor_diagnostics" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
      + name                           = "fd-log-analytics"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "FrontdoorAccessLog"

          + retention_policy {
              + days    = 7
              + enabled = true
            }
        }
      + enabled_log {
          + category = "FrontdoorWebApplicationFirewallLog"

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
    }

  # module.landing_zone[0].azurerm_role_assignment.frontdoor_kv_access[0] will be created
  + resource "azurerm_role_assignment" "frontdoor_kv_access" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0a7e9367-4349-4b24-974a-bfa7b23a38fc"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/cft-platform-dev-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsdev"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 8 to add, 0 to change, 8 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1776,"Program":"tfcmt","SHA1":"","Target":"dev_global","Vars":{}} -->